CalPlug/ADE7953-Wattmeter/library/ESP32_SPI/ADE7953ESP32/ADE7953ESP32.cpp
//*******************************************************************************************


//****************User Program Functions*****************


uint8_t ADE7953::getVersion(){
  return spiAlgorithm8_read(functionBitVal(Version_8,1), functionBitVal(Version_8,0));  //An example of the address lookup - the spiAlgorithm8_read((functionBitVal(addr,1), functionBitVal(addr,1)) would return the eqivenet to spiAlgorithm8_read(0x07,0x02) when working properly
}

float ADE7953::getPowerFactorA(){  
	int16_t value=0;  
	value=spiAlgorithm16_read((functionBitVal(PFA_16,1)),(functionBitVal(PFA_16,0))); 
	float decimal = decimalize(value, 327.67, 0);
return abs(decimal);
  }     

int16_t ADE7953::getPhaseCalibA(){  
	int16_t value=0;  
	value=spiAlgorithm16_read((functionBitVal(PHCALA_16,1)),(functionBitVal(PHCALA_16,0))); 
return value;
  }   

float ADE7953::getPeriod(){  
	uint16_t value=0;  
	value=spiAlgorithm16_read((functionBitVal(Period_16,1)),(functionBitVal(Period_16,0))); 
	float decimal = decimalize(value, 1, 0);
return decimal;
  }

unsigned long ADE7953::getAPNOLOAD(){  //use signed long for signed registers, and unsigned long for unsigned registers
	unsigned long value=0;  //use signed long for signed registers, and unsigned long for unsigned registers
	value=spiAlgorithm32_read((functionBitVal(AP_NOLOAD_32,1)),(functionBitVal(AP_NOLOAD_32,0))); //Call MSB and LSB from the register constant (template for how all functions should be called)
return value;
  }
  
long ADE7953::getInstVoltage(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(V_32,1)),(functionBitVal(V_32,0)));
return value;
  }
  
float ADE7953::getVrms(){  
	unsigned long value=0;  
	value=spiAlgorithm32_read((functionBitVal(VRMS_32,1)),(functionBitVal(VRMS_32,0)));
	float decimal = decimalize(value, 19090, 0);
return decimal;
  }  
  
long ADE7953::getInstCurrentA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(IA_32,1)),(functionBitVal(IA_32,0))); 
return value;
  }
  
float ADE7953::getIrmsA(){  
	unsigned long value=0;  
	value=spiAlgorithm32_read((functionBitVal(IRMSA_32,1)),(functionBitVal(IRMSA_32,0))); 
	float decimal = decimalize(value, 1327, 0);
return decimal;
  }
  
float ADE7953::getIrmsB(){
	unsigned long value=0;
	value=spiAlgorithm32_read((functionBitVal(IRMSB_32,1)), (functionBitVal(IRMSB_32, 0)));
	float decimal = decimalize(value, 1327, 0);
return decimal;
	}
  
unsigned long ADE7953::getVpeak(){  
	unsigned long value=0;  
	value=spiAlgorithm32_read((functionBitVal(VPEAK_32,1)),(functionBitVal(VPEAK_32,0))); 
return value;
  }

unsigned long ADE7953::getIpeakA(){  
	unsigned long value=0;  
	value=spiAlgorithm32_read((functionBitVal(IAPEAK_32,1)),(functionBitVal(IAPEAK_32,0))); 
return value;
  }

long ADE7953::getActiveEnergyA(){  
	long value=0; 
	value=spiAlgorithm32_read((functionBitVal(AENERGYA_32,1)),(functionBitVal(AENERGYA_32,0))); 
return value;
  }
  
long ADE7953::getReactiveEnergyA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(RENERGYA_32,1)),(functionBitVal(RENERGYA_32,0))); 
return value;
  }

long ADE7953::getApparentEnergyA(){ 
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(APENERGYA_32,1)),(functionBitVal(APENERGYA_32,0))); 
return value;
  }
    
float ADE7953::getInstApparentPowerA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(AVA_32,1)),(functionBitVal(AVA_32,0))); 
	float decimal = decimalize(value, 1.502, 0);
return abs(decimal);
  }
  
float ADE7953::getInstActivePowerA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(AWATT_32,1)),(functionBitVal(AWATT_32,0))); 
	float decimal = decimalize(value, 1.502, 0);
return abs(decimal);
  }
  
float ADE7953::getInstReactivePowerA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(AVAR_32,1)),(functionBitVal(AVAR_32,0))); 
	float decimal = decimalize(value, 1.502, 0);
return decimal;
  }
  
//*******************************************************


//****************ADE 7953 Library Control Functions**************************************

//****************Object Definition*****************
ADE7953::ADE7953(int SS, int SPI_freq)
{
  _SS=SS;
  _SPI_freq=SPI_freq;
  }
//**************************************************

//****************Initialization********************
void ADE7953::initialize(){
    
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953:initialize function started "); 
  #endif
// Slave select is 15

  #ifdef NEWBRANDY
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  pinMode(_SS, OUTPUT);
  digitalWrite(_SS, HIGH);
  delay(50);
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0xFE);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0xAD);       
  spiTransferByte(spy, 0x01);
  spiTransferByte(spy, 0x20);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0x30);  
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef BRANDY
  spy = spiStartBus(FSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  pinMode(_SS, OUTPUT);
  digitalWrite(_SS, HIGH);
  delay(50);
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0xFE);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0xAD);       
  spiTransferByte(spy, 0x01);
  spiTransferByte(spy, 0x20);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0x30);  
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef DEVKIT
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMISO(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachSS(spy, -1, -1);
  delay(50);
  spiEnableSSPins(spy, SPI_CS0);
  spiSSSet(spy);  
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0xFE);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0xAD);       
  spiTransferByte(spy, 0x01);
  spiTransferByte(spy, 0x20);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0x30);  
  spiSSClear(spy);
  spiStopBus(spy);
  #endif
  
