CalPlug/ADE7953-Wattmeter/library/ESP32_SPI/ADE7953ESP32/ADE7953ESP32.cpp
  // pinMode(_SS, OUTPUT); // FYI: SS is pin 10 by Arduino's SPI library, set SS pin as Output
  // digitalWrite(_SS, HIGH); //Initialize pin as HIGH
  // SPI.begin();
  // delay(50);
  // SPI.setBitOrder(MSBFIRST);  //Define MSB as first (explicitly)
  // SPI.beginTransaction(SPISettings(_SPI_freq, MSBFIRST, SPI_MODE3));  //Begin SPI transfer with most significant byte (MSB) first. Clock is high when inactive. Read at rising edge: SPIMODE3.
  // delay(50);
  
  // //Write 0x00AD to Register Address 0x00FE. "This unlocks Register 0x120."
  // digitalWrite(_SS, LOW);//Enable data transfer by bringing SS line LOW.
  // SPI.transfer(0x00); //Pass in MSB of register 0x00FE first.
  // SPI.transfer(0xFE); //Pass in LSB of register 0x00FE next.
  // SPI.transfer(WRITE);//This tells the ADE7953 that data is to be written to register 0x00FE.
  // SPI.transfer(0x00); //Pass in MSB of 0x00AD first to write to 0x00FE.
  // SPI.transfer(0xAD); //Pass in LSB of 0x00AD next to write to 0x00FE.
  
  // //Write 0x0030 to Register Address 0x0120. "This configures the optimum settings."
  // SPI.transfer(0x01); //Pass in MSB of register 0x0120 first.
  // SPI.transfer(0x20); //Pass in LSB of register 0x0120 next.
  // SPI.transfer(WRITE);//This tells the ADE7953 that data is to be written to register 0x0120.
  // SPI.transfer(0x00); //Pass in MSB of 0x0030 first to write to 0x0120.
  // SPI.transfer(0x30); //Pass in LSB of 0x0030 next to write to 0x0120.
  // SPI.endTransaction();
  // digitalWrite(_SS, HIGH);//End data transfer by bringing SS line HIGH.
  
  
  delay(100);
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print(" ADE7953:initialize function completed "); 
  #endif
  
  //Calibrations
  //spiAlgorithm16_write((functionBitVal(PHCALA_16,1)),(functionBitVal(PHCALA_16,0)),0x00,0x00);
  //delay(100);
  spiAlgorithm32_write((functionBitVal(AP_NOLOAD_32,1)),(functionBitVal(AP_NOLOAD_32,0)),0x00,0x00,0x00,0x01); //Check for ensuring read and write operations are okay
  delay(100);
  spiAlgorithm8_write((functionBitVal(LCYCMODE_8,1)),(functionBitVal(LCYCMODE_8,0)),0b01111111); //Enable line cycle accumulation mode for all energies and channels
  delay(100);
  spiAlgorithm16_write((functionBitVal(LINECYC_16,1)),(functionBitVal(LINECYC_16,0)),0x00,0x78); //Sets number of half line cycle accumulations to 120
  delay(100);

}
//**************************************************

byte ADE7953::functionBitVal(int addr, uint8_t byteVal)
{
//Returns as integer an address of a specified byte - basically a byte controlled shift register with "byteVal" controlling the byte that is read and returned
  int x = ((addr >> (8*byteVal)) & 0xff);
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::functionBitVal function details: ");
   Serial.print("Address input (dec): ");  
   Serial.print(addr, DEC);
   Serial.print(" Byte requested (dec): ");  
   Serial.print(byteVal, DEC);
   Serial.print(" Returned Value (dec): ");
   Serial.print(x, DEC);  
   Serial.print(" Returned Value (HEX): ");
   Serial.print(x, HEX); 
   Serial.print(" ADE7953::functionBitVal function completed "); 
  #endif
  
  return x;
}

uint8_t ADE7953::spiAlgorithm8_read(byte MSB, byte LSB) { //This is the algorithm that reads from a register in the ADE7953. The arguments are the MSB and LSB of the address of the register respectively. The values of the arguments are obtained from the list of functions above.
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm8_read function started "); 
  #endif
  uint8_t readval_unsigned = 0;  //This variable is the unsigned integer value to compile read bytes into (if needed)
  byte one;
  byte two; //This may be a dummy read, it looks like the ADE7953 is outputting an extra byte as a 16 bit response even for a 1 byte return
  
  #ifdef NEWBRANDY
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);  
  spiTransferByte(spy, READ);    
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef BRANDY
  spy = spiStartBus(FSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  //pinMode(_SS, OUTPUT);
  //digitalWrite(_SS, HIGH);  
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);  
  spiTransferByte(spy, READ);    
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  
  #ifdef DEVKIT
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMISO(spy, -1);
  spiAttachMOSI(spy, -1);  
  spiAttachSS(spy, -1, -1);
  spiEnableSSPins(spy, SPI_CS0);
  spiSSSet(spy);  
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);  
  spiTransferByte(spy, READ);    
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);  
  spiSSClear(spy);
  spiStopBus(spy);
  #endif  
  //digitalWrite(_SS, LOW);  //Enable data transfer by bringing SS line LOW
  
  //SPI.beginTransaction(SPISettings(_SPI_freq, MSBFIRST, SPI_MODE3));  //Begin SPI transfer with most significant byte (MSB) first. Clock is high when inactive. Read at rising edge: SPIMODE3.
  
  // SPI.transfer(MSB);  //Pass in MSB of register to be read first.
  // SPI.transfer(LSB);  //Pass in LSB of register to be read next.
  //Read in values sequentially and bitshift for a 32 bit entry
  
  //SPI.transfer(READ); //Send command to begin readout
  
  // one = (SPI.transfer(WRITE));  //MSB Byte 1  (Read in data on dummy write (null MOSI signal)) - only one needed as 1 byte
  // two = (SPI.transfer(WRITE));  //"LSB "Byte 2?"  (Read in data on dummy write (null MOSI signal)) - only one needed as 1 byte, but it seems like it responses will send a byte back in 16 bit response total, likely this LSB is useless, but for timing it will be collected.  This may always be a duplicate of the first byte, 
  
  // SPI.endTransaction();
  // digitalWrite(_SS, HIGH);  //End data transfer by bringing SS line HIGH
  
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm8_read function details: ");
   Serial.print("Address Byte 1(MSB)[HEX]: ");  
   Serial.print(MSB, HEX);
   Serial.print(" Address Byte 2(LSB)[HEX]: ");  
   Serial.print(LSB, HEX);
   Serial.print(" Returned bytes (1(MSB) and 2 - 2nd is for 16-bit return form): ");
   Serial.print(one, HEX);
   Serial.print(" ");
   Serial.print(two, HEX);
   Serial.print(" ADE7953::spiAlgorithm8_read function completed "); 
  #endif
  
  //Post-read packing and bitshifting operation
    readval_unsigned = one;  //Process MSB (nothing much to see here for only one 8 bit value)
  
	return readval_unsigned;  //uint8_t versus long because it is only an 8 bit value, function returns uint8_t.
 }
  

uint16_t ADE7953::spiAlgorithm16_read(byte MSB, byte LSB) { //This is the algorithm that reads from a register in the ADE7953. The arguments are the MSB and LSB of the address of the register respectively. The values of the arguments are obtained from the list of functions above.
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm16_read function started "); 
  #endif
  uint16_t readval_unsigned = 0;  //This variable is the unsigned integer value to compile read bytes into (if needed)
  byte one;
  byte two;
  
