CalPlug/ADE7953-Wattmeter/library/ESP32_SPI/ADE7953ESP32/ADE7953ESP32.cpp
  #ifdef NEWBRANDY
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);  
  spiTransferByte(spy, READ);    
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef BRANDY
  spy = spiStartBus(FSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  //pinMode(_SS, OUTPUT);
  //digitalWrite(_SS, HIGH);  
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);  
  spiTransferByte(spy, READ);    
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef DEVKIT
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMISO(spy, -1);
  spiAttachMOSI(spy, -1);  
  spiAttachSS(spy, -1, -1);
  spiEnableSSPins(spy, SPI_CS0);
  spiSSSet(spy);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, READ);
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);  
  spiSSClear(spy);
  spiStopBus(spy);
  #endif
  
  
  // digitalWrite(_SS, LOW);  //Enable data transfer by bringing SS line LOW
  // SPI.beginTransaction(SPISettings(_SPI_freq, MSBFIRST, SPI_MODE3));  //Begin SPI transfer with most significant byte (MSB) first. Clock is high when inactive. Read at rising edge: SPIMODE3.
  // SPI.transfer(MSB);  //Pass in MSB of register to be read first.
  // SPI.transfer(LSB);  //Pass in LSB of register to be read next.
  //Read in values sequentially and bitshift for a 32 bit entry
  //SPI.transfer(READ); //Send command to begin readout
  // one = SPI.transfer(WRITE);  //MSB Byte 1  (Read in data on dummy write (null MOSI signal))
  // two = SPI.transfer(WRITE);  //LSB Byte 2  (Read in data on dummy write (null MOSI signal))
  // SPI.endTransaction();
  // digitalWrite(_SS, HIGH);  //End data transfer by bringing SS line HIGH
  
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm16_read function details: ");
   Serial.print("Address Byte 1(MSB)[HEX]: ");  
   Serial.print(MSB, HEX);
   Serial.print(" Address Byte 2(LSB)[HEX]: ");  
   Serial.print(LSB, HEX);
   Serial.print(" Returned bytes (1(MSB) and 2) [HEX]: ");
   Serial.print(one, HEX);
   Serial.print(" ");
   Serial.print(two, HEX);
   Serial.print(" ADE7953::spiAlgorithm16_read function completed "); 
  #endif
   
   //Post-read packing and bitshifting operation
   //readval_unsigned = (((uint32_t) one << 8) + ((uint32_t) two));  //(Alternate bitshift algorithm)
   
   readval_unsigned = (one << 8);  //Process MSB  (Alternate bitshift algorithm)
   readval_unsigned = readval_unsigned + two;  //Process LSB
			   
			return readval_unsigned;	
    }
  


uint32_t ADE7953::spiAlgorithm24_read(byte MSB, byte LSB) { //This is the algorithm that reads from a register in the ADE7953. The arguments are the MSB and LSB of the address of the register respectively. The values of the arguments are obtained from the list of functions above.
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm24_read function started "); 
  #endif 
  //long readval_signed=0;
  uint32_t readval_unsigned = 0;  //This variable is the unsigned integer value to compile read bytes into (if needed)
  byte one;
  byte two;
  byte three;
  
  #ifdef NEWBRANDY
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);  
  spiTransferByte(spy, READ);    
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  three = spiTransferByte(spy, WRITE);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef BRANDY
  spy = spiStartBus(FSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  //pinMode(_SS, OUTPUT);
  //digitalWrite(_SS, HIGH);  
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);  
  spiTransferByte(spy, READ);    
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  three = spiTransferByte(spy, WRITE);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef DEVKIT
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMISO(spy, -1);
  spiAttachMOSI(spy, -1);  
  spiAttachSS(spy, -1, -1);
  spiEnableSSPins(spy, SPI_CS0);
  spiSSSet(spy);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, READ);
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  three = spiTransferByte(spy, WRITE);
  spiSSClear(spy);
  spiStopBus(spy);
  #endif 

  
  // digitalWrite(_SS, LOW);  //Enable data transfer by bringing SS line LOW
  // SPI.beginTransaction(SPISettings(_SPI_freq, MSBFIRST, SPI_MODE3));  //Begin SPI transfer with most significant byte (MSB) first. Clock is high when inactive. Read at rising edge: SPIMODE3.
  // SPI.transfer(MSB);  //Pass in MSB of register to be read first.
  // SPI.transfer(LSB);  //Pass in LSB of register to be read next.
  //Read in values sequentially and bitshift for a 32 bit entry
  // SPI.transfer(READ); //Send command to begin readout
  // one= SPI.transfer(WRITE); //MSB Byte 1  (Read in data on dummy write (null MOSI signal))
  // two= SPI.transfer(WRITE);   // (Read in data on dummy write (null MOSI signal))
  // three= SPI.transfer(WRITE); //LSB Byte 3  (Read in data on dummy write (null MOSI signal))
  // SPI.endTransaction();
  // digitalWrite(_SS, HIGH);  //End data transfer by bringing SS line HIGH
  
 #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm24_read function details: ");
   Serial.print("Address Byte 1(MSB)[HEX]: ");  
   Serial.print(MSB, HEX);
   Serial.print(" Address Byte 2(LSB)[HEX]: ");  
   Serial.print(LSB, HEX);
   Serial.print(" Returned bytes (1(MSB) to 3)[HEX]: ");
   Serial.print(one, HEX);
   Serial.print(" ");
   Serial.print(two, HEX);
   Serial.print(" ");
   Serial.print(three, HEX);
   Serial.print(" ADE7953::spiAlgorithm24_read function completed "); 
  #endif

  //Post-read packing and bitshifting operation
  readval_unsigned = (((uint32_t) one << 16)+ ((uint32_t) two << 8) + ((uint32_t) three)); //(Alternative shift algorithm)
   

   
 // readval_unsigned =  ((one << 16) & 0x00FF0000);  //process MSB  //(Alternative shift algorithm)
 // readval_unsigned = readval_unsigned + ((two << 8) & 0X0000FF00);
 // readval_unsigned = readval_unsigned + (three & 0X000000FF);  //Process LSB

			return readval_unsigned;
  }
  

uint32_t ADE7953::spiAlgorithm32_read(byte MSB, byte LSB) { //This is the algorithm that reads from a 32 bit register in the ADE7953. The arguments are the MSB and LSB of the address of the register respectively. The values of the arguments are obtained from the list of functions above.  Caution, some register elements contain information that is only 24 bit with padding on the MSB
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm32_read function started "); 
  #endif 
  uint32_t readval_unsigned = 0;  //This variable is the unsigned integer value to compile read bytes into (if needed)
  byte one;
  byte two;
  byte three;
  byte four;
  #ifdef NEWBRANDY
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);  
  spiTransferByte(spy, READ);    
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  three = spiTransferByte(spy, WRITE);
  four = spiTransferByte(spy, WRITE);	
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef BRANDY
  spy = spiStartBus(FSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  //pinMode(_SS, OUTPUT);
  //digitalWrite(_SS, HIGH);  
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);  
  spiTransferByte(spy, READ);    
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  three = spiTransferByte(spy, WRITE);
  four = spiTransferByte(spy, WRITE);	
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef DEVKIT
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMISO(spy, -1);
  spiAttachMOSI(spy, -1);  
  spiAttachSS(spy, -1, -1);
  spiEnableSSPins(spy, SPI_CS0);
  spiSSSet(spy);  
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, READ);
  one = spiTransferByte(spy, WRITE);
  two = spiTransferByte(spy, WRITE);
  three = spiTransferByte(spy, WRITE);
  four = spiTransferByte(spy, WRITE);	
  spiSSClear(spy);
  spiStopBus(spy);
  #endif  
  
  
  // digitalWrite(_SS, LOW);  //Enable data transfer by bringing SS line LOW
  // SPI.beginTransaction(SPISettings(_SPI_freq, MSBFIRST, SPI_MODE3));  //Begin SPI transfer with most significant byte (MSB) first. Clock is high when inactive. Read at rising edge: SPIMODE3.
  // SPI.transfer(MSB);  //Pass in MSB of register to be read first.
  // SPI.transfer(LSB);  //Pass in LSB of register to be read next.
  // //Read in values sequentially and bitshift for a 32 bit entry
  // SPI.transfer(READ); //Send command to begin readout
  // one= SPI.transfer(WRITE); //MSB Byte 1  (Read in data on dummy write (null MOSI signal))
  // two= SPI.transfer(WRITE);   // (Read in data on dummy write (null MOSI signal))
  // three= SPI.transfer(WRITE);   // (Read in data on dummy write (null MOSI signal))
  // four= SPI.transfer(WRITE); //LSB Byte 4  (Read in data on dummy write (null MOSI signal))
  // SPI.endTransaction();
  // digitalWrite(_SS, HIGH);  //End data transfer by bringing SS line HIGH
  
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm32_read function details: ");
   //Serial.print("Address Byte 1(MSB)[HEX]: ");  
   //Serial.print(MSB, BIN);
   //Serial.print(" Address Byte 2(LSB)[HEX]: ");  
   //Serial.print(LSB, BIN);
   Serial.print(" Returned bytes (1(MSB) to 4)[HEX]: ");
   Serial.print(one, BIN);
   Serial.print(" ");
   Serial.print(two, BIN);
   Serial.print(" ");
   Serial.print(three, BIN);
   Serial.print(" ");
   Serial.print(four, BIN);
   Serial.print(" ADE7953::spiAlgorithm32_read function completed "); 
  #endif
  
  //Post-read packing and bitshifting operation
  readval_unsigned = (((uint32_t) one << 24)+ ((uint32_t) two << 16) + ((uint32_t) three << 8) + (uint32_t) four);
  
