CalPlug/ADE7953-Wattmeter/library/ESP32_SPI/ADE7953ESP32/ADE7953ESP32.cpp
/*   readval_unsigned = (one << 24);  //Process MSB 
  //Serial.println(readval_unsigned, HEX);  
  readval_unsigned = readval_unsigned + (two << 16);  
  //Serial.println(readval_unsigned, HEX);
  readval_unsigned = readval_unsigned + (three << 8);  
  //Serial.println(readval_unsigned, HEX);
  readval_unsigned = (readval_unsigned + (four));  //Process LSB
  Serial.println(readval_unsigned, BIN);  */

  return readval_unsigned;
}


void ADE7953::spiAlgorithm32_write(byte MSB, byte LSB, byte onemsb, byte two, byte three, byte fourlsb) { //This is the algorithm that writes to a register in the ADE7953. The arguments are the MSB and LSB of the address of the register respectively. The values of the arguments are obtained from the list of functions above.
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print(" spiAlgorithm32_write function started "); 
  #endif 
  #ifdef NEWBRANDY
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiTransferByte(spy, two);
  spiTransferByte(spy, three);
  spiTransferByte(spy, fourlsb); 	
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef BRANDY
  spy = spiStartBus(FSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  //pinMode(_SS, OUTPUT);
  //digitalWrite(_SS, HIGH);  
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiTransferByte(spy, two);
  spiTransferByte(spy, three);
  spiTransferByte(spy, fourlsb); 	
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef DEVKIT
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMISO(spy, -1);
  spiAttachMOSI(spy, -1);  
  spiAttachSS(spy, -1, -1);
  spiEnableSSPins(spy, SPI_CS0);
  spiSSSet(spy);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiTransferByte(spy, two);
  spiTransferByte(spy, three);
  spiTransferByte(spy, fourlsb);  
  spiSSClear(spy);
  #endif  
  
  // digitalWrite(_SS, LOW);  //Enable data transfer by bringing SS line LOW
  // SPI.beginTransaction(SPISettings(_SPI_freq, MSBFIRST, SPI_MODE3));  //Begin SPI transfer with most significant byte (MSB) first. Clock is high when inactive. Read at rising edge: SPIMODE3.
  // SPI.transfer(MSB);  //Pass in MSB of register to be read first.
  // SPI.transfer(LSB);  //Pass in LSB of register to be read next.
  // //Send the Write command
  // SPI.transfer(WRITE);
  // SPI.transfer(onemsb);
  // SPI.transfer(two);
  // SPI.transfer(three);
  // SPI.transfer(fourlsb);
  // digitalWrite(_SS, HIGH);  //End data transfer by bringing SS line HIGH
  
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm32_read function details: ");
   Serial.print("Address Byte 1(MSB)[HEX]: ");  
   Serial.print(MSB, HEX);
   Serial.print(" Address Byte 2(LSB)[HEX]: ");  
   Serial.print(LSB, HEX);
   Serial.print(" Written bytes (1(MSB) to 4)[HEX]: "); //MSB to LSB order
   Serial.print(onemsb, HEX);
   Serial.print(" ");
   Serial.print(two, HEX);
   Serial.print(" ");
   Serial.print(three, HEX);
   Serial.print(" ");
   Serial.print(fourlsb, HEX);
   Serial.print(" spiAlgorithm32_write function completed "); 
  #endif
  }
  
  void ADE7953::spiAlgorithm24_write(byte MSB, byte LSB, byte onemsb, byte two, byte threelsb) { //This is the algorithm that writes to a register in the ADE7953. The arguments are the MSB and LSB of the address of the register respectively. The values of the arguments are obtained from the list of functions above.
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print(" spiAlgorithm24_write function started "); 
  #endif
  #ifdef NEWBRANDY
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiTransferByte(spy, two);
  spiTransferByte(spy, threelsb);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef BRANDY
  spy = spiStartBus(FSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  //pinMode(_SS, OUTPUT);
  //digitalWrite(_SS, HIGH);  
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiTransferByte(spy, two);
  spiTransferByte(spy, threelsb);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef DEVKIT
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMISO(spy, -1);
  spiAttachMOSI(spy, -1);  
  spiAttachSS(spy, -1, -1);
  spiEnableSSPins(spy, SPI_CS0);
  spiSSSet(spy);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiTransferByte(spy, two);
  spiTransferByte(spy, threelsb);  
  spiSSClear(spy);
  #endif
  
  // digitalWrite(_SS, LOW);  //Enable data transfer by bringing SS line LOW
  // SPI.beginTransaction(SPISettings(_SPI_freq, MSBFIRST, SPI_MODE3));  //Begin SPI transfer with most significant byte (MSB) first. Clock is high when inactive. Read at rising edge: SPIMODE3.
  // SPI.transfer(MSB);  //Pass in MSB of register to be read first.
  // SPI.transfer(LSB);  //Pass in LSB of register to be read next.
  // //Send the Write command
  // SPI.transfer(WRITE);
  // SPI.transfer(onemsb);
  // SPI.transfer(two);
  // SPI.transfer(threelsb);
  // digitalWrite(_SS, HIGH);  //End data transfer by bringing SS line HIGH
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm24_read function details: ");
   Serial.print("Address Byte 1(MSB)[HEX]: ");  
   Serial.print(MSB, HEX);
   Serial.print(" Address Byte 2(LSB)[HEX]: ");  
   Serial.print(LSB, HEX);
   Serial.print(" Written bytes (1(MSB) to 3)[HEX]: ");  //MSB to LSB order
   Serial.print(onemsb, HEX);
   Serial.print(" ");
   Serial.print(two, HEX);
   Serial.print(" ");
   Serial.print(threelsb, HEX);
   Serial.print(" spiAlgorithm24_write function completed "); 
  #endif
  }
  
void ADE7953::spiAlgorithm16_write(byte MSB, byte LSB, byte onemsb, byte twolsb) { //This is the algorithm that writes to a register in the ADE7953. The arguments are the MSB and LSB of the address of the register respectively. The values of the arguments are obtained from the list of functions above.
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print(" spiAlgorithm16_write function started "); 
  #endif
  #ifdef NEWBRANDY
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiTransferByte(spy, twolsb);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef BRANDY
  spy = spiStartBus(FSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  //pinMode(_SS, OUTPUT);
  //digitalWrite(_SS, HIGH);  
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiTransferByte(spy, twolsb);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef DEVKIT
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMISO(spy, -1);
  spiAttachMOSI(spy, -1);  
  spiAttachSS(spy, -1, -1);
  spiEnableSSPins(spy, SPI_CS0);
  spiSSSet(spy);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiTransferByte(spy, twolsb);
  spiSSClear(spy);
  #endif
  
  // digitalWrite(_SS, LOW);  //Enable data transfer by bringing SS line LOW
  // SPI.beginTransaction(SPISettings(_SPI_freq, MSBFIRST, SPI_MODE3));  //Begin SPI transfer with most significant byte (MSB) first. Clock is high when inactive. Read at rising edge: SPIMODE3.
  // SPI.transfer(MSB);  //Pass in MSB of register to be read first.
  // SPI.transfer(LSB);  //Pass in LSB of register to be read next.
  // //Send the Write command
  // SPI.transfer(WRITE);
  // SPI.transfer(onemsb);
  // SPI.transfer(twolsb);
  // digitalWrite(_SS, HIGH);  //End data transfer by bringing SS line HIGH
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm16_read function details: ");
   Serial.print("Address Byte 1(MSB)[HEX]: ");  
   Serial.print(MSB, HEX);
   Serial.print(" Address Byte 2(LSB)[HEX]: ");  
   Serial.print(LSB, HEX);
   Serial.print(" Written bytes (1(MSB) to 2)[HEX]: ");  //MSB to LSB order
   Serial.print(onemsb, HEX);
   Serial.print(" ");
   Serial.print(twolsb, HEX);
   Serial.print(" spiAlgorithm16_write function completed "); 
  #endif
  }
  
void ADE7953::spiAlgorithm8_write(byte MSB, byte LSB, byte onemsb) { //This is the algorithm that writes to a register in the ADE7953. The arguments are the MSB and LSB of the address of the register respectively. The values of the arguments are obtained from the list of functions above.
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print(" spiAlgorithm8_write function started "); 
  #endif
  #ifdef NEWBRANDY
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);  
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef BRANDY
  spy = spiStartBus(FSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  //pinMode(_SS, OUTPUT);
  //digitalWrite(_SS, HIGH);  
  digitalWrite(_SS, LOW);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  digitalWrite(_SS, HIGH);
  spiStopBus(spy);
  #endif
  #ifdef DEVKIT
  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMISO(spy, -1);
  spiAttachMOSI(spy, -1);  
  spiAttachSS(spy, -1, -1);
  spiEnableSSPins(spy, SPI_CS0);
  spiSSSet(spy);
  spiTransferByte(spy, MSB);
  spiTransferByte(spy, LSB);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, onemsb);
  spiSSClear(spy);  
  #endif
  
  // digitalWrite(_SS, LOW);  //Enable data transfer by bringing SS line LOW
  // SPI.beginTransaction(SPISettings(_SPI_freq, MSBFIRST, SPI_MODE3));  //Begin SPI transfer with most significant byte (MSB) first. Clock is high when inactive. Read at rising edge: SPIMODE3.
  // SPI.transfer(MSB);  //Pass in MSB of register to be read first.
  // SPI.transfer(LSB);  //Pass in LSB of register to be read next.
  // //Send the Write command
  // SPI.transfer(WRITE);
  // SPI.transfer(onemsb);
  // digitalWrite(_SS, HIGH);  //End data transfer by bringing SS line HIGH
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::spiAlgorithm8_read function details: ");
   Serial.print("Address Byte 1(MSB)[HEX]: ");  
   Serial.print(MSB, HEX);
   Serial.print(" Address Byte 2(LSB)[HEX]: ");   
   Serial.print(LSB, HEX);
   Serial.print(" Written bytes (1 of 1)[HEX]: ");  //MSB to LSB order
   Serial.print(onemsb, HEX);
   Serial.print(" spiAlgorithm16_write function completed "); 
  #endif
  }
  
float ADE7953::decimalize(long input, float factor, float offset) //This function adds a decimal point to the input value and returns it as a float
{
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953::calibration function executed ");
  #endif
return ((float)input/factor)+offset;
}
